In [1]:
print("Atharva")

Atharva

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
plt.rcParams["figure.figsize"]=(12,7)
import seaborn as sns

In [3]:
df=pd.read_csv('employee_data.csv')

In [4]:
df.head()

,number,first_name,last_name,gender,birth_date,employment_status,annual_salary,tax_file_no
0,483,Lenord,Kihn,M,1994-07-01,NaN,64598.0,NaN
1,478,Palma,Beahan,F,1972-05-06,PE,124103.0,NaN
2,348,Hebert,Muller,M,1990-09-04,PE,100324.0,NaN
3,757,Virginia,Ullrich,M,1991-09-23,PE,144957.0,NaN
4,937,Roby,Hudson,M,1997-01-15,NaN,137659.0,NaN

In [6]:
df.isnull().sum()

number                  0
first_name              1
last_name               1
gender                207
birth_date              1
employment_status     189
annual_salary           1
tax_file_no          1000
dtype: int64

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   number             1000 non-null   int64
 1   first_name         999 non-null    object
 2   last_name          999 non-null    object
 3   gender             793 non-null    object
 4   birth_date         999 non-null    object
 5   employment_status  811 non-null    object
 6   annual_salary      999 non-null    float64
 7   tax_file_no        0 non-null      float64
dtypes: float64(2), int64(1), object(5)
memory usage: 62.6+ KB

In [8]:
df.describe()

           number  annual_salary  tax_file_no
count  1000.00000     999.000000          0.0
mean    499.50200  102017.196196          NaN
std     285.86318   27567.849832          NaN
min       1.00000   55003.000000          NaN
25%     250.50000   77720.000000          NaN
50%     492.00000  101133.000000          NaN
75%     750.25000  125829.000000          NaN
max     999.00000  149999.000000          NaN

In [10]:
df.groupby("gender").mean()

C:\Users\Icon\AppData\Local\Temp\ipykernel_26356\2781464171.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("gender").mean()

            number  annual_salary  tax_file_no
gender
F       517.205805  103478.147757          NaN
M       490.850242  100927.826087          NaN

In [11]:
df.groupby("gender").median()

C:\Users\Icon\AppData\Local\Temp\ipykernel_26356\328478680.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.median is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("gender").median()

        number  annual_salary  tax_file_no
gender
F        531.0       106218.0          NaN
M        474.0        98702.5          NaN

In [12]:
df.groupby("gender").min()

C:\Users\Icon\AppData\Local\Temp\ipykernel_26356\3982592671.py:1: FutureWarning: Dropping invalid columns in DataFrameGroupBy.min is deprecated. In a future version, a TypeError will be raised. Before calling .min, select only columns which should be valid for the function.
  df.groupby("gender").min()

        number first_name last_name  birth_date  annual_salary  tax_file_no
gender
F            1      Abbey    Abbott  1970-01-17        55033.0          NaN
M            5        Abe    Abbott  1970-01-19        55003.0          NaN

In [13]:
df.groupby("gender").max()

C:\Users\Icon\AppData\Local\Temp\ipykernel_26356\1702392904.py:1: FutureWarning: Dropping invalid columns in DataFrameGroupBy.max is deprecated. In a future version, a TypeError will be raised. Before calling .max, select only columns which should be valid for the function.
  df.groupby("gender").max()

        number first_name last_name  birth_date  annual_salary  tax_file_no
gender
F          997     Zilpha   Zboncak  1999-10-21       149999.0          NaN
M          999       Zita    Zulauf  1999-12-07       149941.0          NaN

In [14]:
df.groupby("gender").std()

C:\Users\Icon\AppData\Local\Temp\ipykernel_26356\3328661029.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("gender").std()

            number  annual_salary  tax_file_no
gender
F       282.635939   27055.352918          NaN
M       293.707093   28115.190494          NaN

In [15]:
df.groupby("gender")['annual_salary'].describe()

,count,mean,std,min,25%,50%,75%,max
gender,,,,,,,,
F,379.0,103478.147757,27055.352918,55033.0,80503.00,106218.0,124700.5,149999.0
M,414.0,100927.826087,28115.190494,55003.0,76017.75,98702.5,125996.0,149941.0